TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc_common.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY TfHEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_rtc_common.h
 *  @brief      Real Time Clock A (RTC Common) Peripheral Interface
 *  @defgroup   Common Real Time Clock (RTC_Common)
 *
 *  @anchor ti_devices_msp_dl_rtc_common_Overview
 *  # Overview
 *  The RTC Common Driver Library allows full configuration of the MSPM0 RTC Common module.
 *  The real-time clock (RTC Common) module provides clock counters with calendar mode,
 *  a flexible programmable alarm, offset calibration, and a provision for
 *  temperature compensation. The module also provides a separate time stamp calendar
 *  capable of capturing a time stamp event upon loss of VDD or detection of a tamper event
 *  on a tamper I/O pin.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup RTC_Common
 * @{
 */
#ifndef ti_dl_dl_rtc_common__include
#define ti_dl_dl_rtc_common__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#if defined __MSPM0_HAS_RTC_A__ || defined __MSPM0_HAS_RTC_B__ || \
    defined __MSPM0_HAS_RTC__ || defined(DOXYGEN__INCLUDE)

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_RTC_COMMON_INTERRUPT
 *  @{
 */

/**
 * @brief RTC Common alarm 1 interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_CALENDAR_ALARM1          (RTC_CPU_INT_IMASK_RTCA1_SET)

/**
 * @brief RTC Common alarm 2 interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_CALENDAR_ALARM2          (RTC_CPU_INT_IMASK_RTCA2_SET)

/**
 * @brief RTC Common prescaler 0 interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_PRESCALER0               (RTC_CPU_INT_IMASK_RT0PS_SET)

/**
 * @brief RTC Common prescaler 1 interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_PRESCALER1               (RTC_CPU_INT_IMASK_RT1PS_SET)

#ifdef __MSPM0_HAS_RTC_A__
/**
 * @brief RTC Common prescaler 2 interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_PRESCALER2                (RTC_CPU_INT_IMASK_RT2PS_SET)
#endif

/**
 * @brief RTC Common interval timer interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_INTERVAL_ALARM           (RTC_CPU_INT_IMASK_RTCTEV_SET)

/**
 * @brief RTC Common ready interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_READY                    (RTC_CPU_INT_IMASK_RTCRDY_SET)

#ifdef __MSPM0_HAS_RTC_A__
/**
 * @brief RTC Time Stamp Event interrupt
 */
#define DL_RTC_COMMON_INTERRUPT_TSEVT                    (RTC_CPU_INT_IMASK_TSEVT_SET)
#endif

/** @}*/

/** @addtogroup DL_RTC_COMMON_EVENT
 *  @{
 */

/**
 * @brief RTC Common alarm 1 event
 */
#define DL_RTC_COMMON_EVENT_CALENDAR_ALARM1              (RTC_GEN_EVENT_IMASK_RTCA1_SET)

/**
 * @brief RTC Common alarm 2 event
 */
#define DL_RTC_COMMON_EVENT_CALENDAR_ALARM2              (RTC_GEN_EVENT_IMASK_RTCA2_SET)

/**
 * @brief RTC Common prescaler 0 event
 */
#define DL_RTC_COMMON_EVENT_PRESCALER0                   (RTC_GEN_EVENT_IMASK_RT0PS_SET)

/**
 * @brief RTC Common prescaler 1 event
 */
#define DL_RTC_COMMON_EVENT_PRESCALER1                   (RTC_GEN_EVENT_IMASK_RT1PS_SET)

#ifdef __MSPM0_HAS_RTC_A__
/**
 * @brief RTC Common prescaler 2 event
 */
#define DL_RTC_COMMON_EVENT_PRESCALER2                   (RTC_GEN_EVENT_IMASK_RT2PS_SET)
#endif

/**
 * @brief RTC Common interval timer event
 */
#define DL_RTC_COMMON_EVENT_INTERVAL_ALARM               (RTC_GEN_EVENT_IMASK_RTCTEV_SET)

/**
 * @brief RTC Common ready event
 */
#define DL_RTC_COMMON_EVENT_READY                        (RTC_GEN_EVENT_IMASK_RTCRDY_SET)

#ifdef __MSPM0_HAS_RTC_A__
/**
 * @brief RTC Common time stamp event
 */
#define DL_RTC_COMMON_EVENT_TSEVT                        (RTC_GEN_EVENT_IMASK_TSEVT_SET)
#endif

/** @}*/

#ifdef __MSPM0_HAS_RTC_A__
/** @addtogroup DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE
 *  @{
 */

/**
 * @brief Tamper IO 0 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_0       (RTC_TSSTAT_TSTIOEVT0_SET)

/**
 * @brief Tamper IO 1 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_1       (RTC_TSSTAT_TSTIOEVT1_SET)

/**
 * @brief Tamper IO 2 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_2       (RTC_TSSTAT_TSTIOEVT2_SET)

/**
 * @brief Tamper IO 3 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_3       (RTC_TSSTAT_TSTIOEVT3_SET)

/**
 * @brief Tamper IO 4 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_4       (RTC_TSSTAT_TSTIOEV4_SET)

/**
 * @brief Tamper IO 5 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_5       (RTC_TSSTAT_TSTIOEVT5_SET)

/**
 * @brief Tamper IO 6 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_6       (RTC_TSSTAT_TSTIOEVT6_SET)

/**
 * @brief Tamper IO 7 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_7       (RTC_TSSTAT_TSTIOEVT7_SET)

/**
 * @brief Tamper IO 8 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_8       (RTC_TSSTAT_TSTIOEV8_SET)

/**
 * @brief Tamper IO 9 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_9       (RTC_TSSTAT_TSTIOEVT9_SET)

/**
 * @brief Tamper IO 10 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_10      (RTC_TSSTAT_TSTIOEVT10_SET)

/**
 * @brief Tamper IO 11 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_11      (RTC_TSSTAT_TSTIOEVT11_SET)

/**
 * @brief Tamper IO 12 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_12      (RTC_TSSTAT_TSTIOEVT12_SET)

/**
 * @brief Tamper IO 13 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_13      (RTC_TSSTAT_TSTIOEVT13_SET)

/**
 * @brief Tamper IO 14 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_14      (RTC_TSSTAT_TSTIOEVT14_SET)

/**
 * @brief Tamper IO 15 caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_TIO_15      (RTC_TSSTAT_TSTIOEVT15_SET)

/**
 * @brief Loss of VDD caused the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE_VDD_LOSS    (RTC_TSSTAT_TSVDDEVT_SET)

/** @}*/

/** @addtogroup DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE
 *  @{
 */

/**
 * @brief Enable Tamper IO 0 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_0      (RTC_TSCTL_TSTIOEN0_ENABLE)

/**
 * @brief Enable Tamper IO 1 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_1      (RTC_TSCTL_TSTIOEN1_ENABLE)

/**
 * @brief Enable Tamper IO 2 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_2      (RTC_TSCTL_TSTIOEN2_ENABLE)

/**
 * @brief Enable Tamper IO 3 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_3      (RTC_TSCTL_TSTIOEN3_ENABLE)

/**
 * @brief Enable Tamper IO 4 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_4      (RTC_TSCTL_TSTIOEN4_ENABLE)

/**
 * @brief Enable Tamper IO 5 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_5      (RTC_TSCTL_TSTIOEN5_ENABLE)

/**
 * @brief Enable Tamper IO 6 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_6      (RTC_TSCTL_TSTIOEN6_ENABLE)

/**
 * @brief Enable Tamper IO 7 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_7      (RTC_TSCTL_TSTIOEN8_ENABLE)

/**
 * @brief Enable Tamper IO 8 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_8      (RTC_TSCTL_TSTIOEN8_ENABLE)

/**
 * @brief Enable Tamper IO 9 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_9      (RTC_TSCTL_TSTIOEN9_ENABLE)

/**
 * @brief Enable Tamper IO 10 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_10     (RTC_TSCTL_TSTIOEN10_ENABLE)

/**
 * @brief Enable Tamper IO 11 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_11     (RTC_TSCTL_TSTIOEN11_ENABLE)

/**
 * @brief Enable Tamper IO 12 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_12     (RTC_TSCTL_TSTIOEN12_ENABLE)

/**
 * @brief Enable Tamper IO 13 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_13     (RTC_TSCTL_TSTIOEN13_ENABLE)

/**
 * @brief Enable Tamper IO 14 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_14     (RTC_TSCTL_TSTIOEN14_ENABLE)

/**
 * @brief Enable Tamper IO 15 as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_TIO_15     (RTC_TSCTL_TSTIOEN15_ENABLE)

/**
 * @brief Enable VDD loss detection as a source to trigger the time stamp event
 */
#define DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE_VDD_LOSS   (RTC_TSCTL_TSVDDEN_ENABLE)

/** @}*/
#endif

